import React from 'react';
import { useDispatch, useSelector } from 'react-redux';
import { NAVIGATION_STORE_NAME } from '../../lib/common/navigation';
import { faqPageUploadData } from './faq-page.action';
import { FaqPageComponent } from './faq-page.component';
import { FAQ_PAGE_STORE_NAME } from './faq-page.constant';

import {
  getRequestErrorMessage,
  isRequestError,
  isRequestPending,
  isRequestSuccess,
} from '../../main/store/store.service';

export function FaqPageContainer() {
  const dispatch = useDispatch();
  const { state, pageLoading } = useSelector((state) => ({
    state: state[FAQ_PAGE_STORE_NAME],
    pageLoading: state[NAVIGATION_STORE_NAME].pageLoading,
  }));

  // React.useEffect(() => {
  //   dispatch(faqPageUploadData());
  // }, []);

  return (
    <FaqPageComponent
      isPending={isRequestPending(state.faqPage)}
      isError={isRequestError(state.faqPage)}
      isSuccess={isRequestSuccess(state.faqPage)}
      errorMessage={getRequestErrorMessage(state.faqPage)}
      pageLoading={pageLoading}
      mainItems={TEST_MAIN_ITEMS_FAQ_PAGE}
      saleItems={TEST_SALE_ITEMS_FAQ_PAGE}
    />
  );
}

export const TEST_MAIN_ITEMS_FAQ_PAGE = [
  {
    titleTid: 'Как выбрать размер',
    contentTid:
      'Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
  },
  {
    titleTid: 'Что значат буквы в указании размера?',
    contentTid:
      'Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
  },
  {
    titleTid: 'Как купить выкройку?',
    contentTid:
      'Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
  },
  {
    titleTid: 'Как скачать выкройку?',
    contentTid:
      'Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
  },
  {
    titleTid: 'Я купил не тот размер, что делать?',
    contentTid:
      'Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
  },
];
export const TEST_SALE_ITEMS_FAQ_PAGE = [
  {
    titleTid: 'Мне пришли несоответствующие моему выбору файлы, что делать?',
    contentTid:
      'Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
  },
  {
    titleTid: 'Мне не пришли файлы на почту, что делать?',
    contentTid:
      'Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
  },
  {
    titleTid: 'Как распечатать выкройку?',
    contentTid:
      'Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
  },
];
