import { FaqPageComponent } from './faq-page.component';
export function FaqPageContainer() {
  return (
    <FaqPageComponent
      mainItems={TEST_MAIN_ITEMS_FAQ_PAGE}
      saleItems={TEST_SALE_ITEMS_FAQ_PAGE}
    />
  );
}

export const TEST_MAIN_ITEMS_FAQ_PAGE = [
  {
    titleTid: 'Как выбрать размер',
    contentTid:
      '* Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
  },
  {
    titleTid: 'Что значат буквы в указании размера?',
    contentTid:
      '* Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
  },
  {
    titleTid: 'Как купить выкройку?',
    contentTid:
      '* Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
  },
  {
    titleTid: 'Как скачать выкройку?',
    contentTid:
      '* Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
  },
  {
    titleTid: 'Я купил не тот размер, что делать?',
    contentTid:
      '* Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
  },
];
export const TEST_SALE_ITEMS_FAQ_PAGE = [
  {
    titleTid: 'Мне пришли несоответствующие моему выбору файлы, что делать?',
    contentTid:
      '* Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
  },
  {
    titleTid: 'Мне не пришли файлы на почту, что делать?',
    contentTid:
      '* Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
  },
  {
    titleTid: 'Как распечатать выкройку?',
    contentTid:
      '* Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
  },
];
