export const ARTICLE_PAGE_ROUTE_PATH = '/article-page';

export const ARTICLE_PAGE_STORE_NAME = 'ARTICLE_PAGE';

export const ARTICLE_PAGE_API = {
  ARTICLE_PAGE_UPLOAD: {
    ENDPOINT: '/',
    TYPE: 'POST',
  },
};

export const TEST_ARTICLE_PAGE_DATA = {
  name: 'Как выбрать размер',
  date: '25.05.2021',
  tables: [
    {
      title: '* Таблица соответствия размеров',
      content: 'Таблица',
      description: null,
    },
    {
      title: '* Таблица соответствия размеров LaForme Plus',
      content: 'Таблица',
      description:
        '* Если величина Ог попадает в межразмерный интервал, например, Ог=98см (между 48 и 50 размерами), то при выборе размера ориентируйтесь на сравнительные данные От и Об, выбирая размер в большую или меньшую сторону.  Если в вашей фигуре разница между Об и Ог находится в пределах  4 — 12 см, то в группе плечевых изделий удобнее корректировать выкройку,  выбранную по Ог  (как и принято в размерной типологии). Группу поясных изделий рекомендуется выбирать по Об и корректировать по От в зоне талиевых вытачек, в рельефах и боковых швах.',
    },
  ],
  description: `
  Ростовые группы в сдвоенных ростах: 158-164 включает роста от 155 см до 167 см, 170-176 включает роста от 168 см до 179 см. Разница по длинам в изделиях составляет ок.6-7 см по низу (длинные модели, брюки) и ок.4 см по длине рукава. 
  Все выкройки LaForme проектируются на перегибистую фигуру с удлиненным передом и укороченной спинкой. Разница Дтп и Дтс в конструкции от 6 см. Если ваша фигура сутулая, то необходимо вносить изменения в лекала до кроя для корректного баланса изделия.
  Некоторые из вас привыкли считать свой размер по европейской системе. В российской же размер это всего лишь Ог/2. Есть ещё полнотные группы, о них читайте ниже.
  Почему не стоит основываться на европейской системе? Потому что у всех марок/брендов разные параметры. Пример, на днях я примеряла пальто Баленсиаги, о котором грежу давно, мне подошёл р.36. По вашим представлениям, 36+6= 42 мой российский. Но мой Ог 90! И взяв выкройку р.42 я бы пролетела (в том числе и в бёдрах)! Потому что мои выкройки четко соответствуют обхватам 2й полнотной группы.
  Что такое полнотные группы — ПГ? Это разница Обхвата Груди и Обхвата Бёдер.
  Выкройки LaForme не большемерят и не маломерят. Они идут размер в размер. Если выкройка 44го размера, то она соответствует Ог 88, Об 96. Обхват талии величина вариативная, зависит от степени прилегания модели и ,внимание, от роста! (Чем выше рост, тем длиннее торс и внутренние органы и грудная клетка растянуты по телу, следовательно талии у высоких тоньше), но чаще всего так же соответствует размерной сетке, в 44м р-ре около 65-67.
  Прибавки. Большая часть моделей LaForme имеет прилегающий силуэт, следовательно, прибавки минимальны. Также могут немного изменяться от размера к размеру. Мы не указываем прибавки к каждой модели, чтобы вы не рассчитывали на их «запас» выбирая меньший размер — это искажает посадку.
  Балансовые показатели. Да, фигура по Гост изрядно устарела. Сейчас самый актуальный и частый тип фигуры — перегибистая. Так как в моде женские формы: ягодицы и грудь. Как это отражается в конструкции: сокращается длина спины Дтс и увеличивается длина переда Дтп. Наши выкройки именно на такие фигуры.
  Как выбрать размер выкройки?!  Грудь важнее всего! Первоначально нужно разделить ваш Ог пополам, например, Ог 96 см, размер 48. Далее сравниваем, проходят ли ваши бёдра в 96+8 (2я полнота) = 104 см. Чаще всего выкройку по бёдрам можно откорректировать без большого опыта в конструировании. Поэтому этот показатель не основной. Как и обхват талии, также легко меняется за счёт раствора вытачек
  `,
  comments: [
    {
      me: false,
      id: 1,
      username: 'Людмила Азонова',
      date: '25.05.2021',
      message: `Подходит для пальтово-костюмной группы тканей.
	  Очень удгобная и хорошая вещь, спасибо! Хотелось бы сказать что вещь правда хороашая и дошла очень быстро, буду заказывать ещё. Из минусов – дороговато, всё таки.`,
    },
    {
      me: false,
      id: 1,
      username: 'Людмила Азонова',
      date: '25.05.2021',
      message: `Подходит для пальтово-костюмной группы тканей. Очень удгобная и хорошая вещь, спасибо!`,
    },
    {
      me: true,
      id: 1,
      username: 'Людмила Азонова',
      date: '25.05.2021',
      message: `Подходит для пальтово-костюмной группы тканей. Очень удгобная и хорошая вещь, спасибо!`,
    },
  ],
};
export const TEST_ARTICLES_ITEMS = [
  {
    id: 1,
    name: 'Мастер-класс по пошиву мужских брюк 1003',
    favorite: true,
    backgroundImage: '/static/test/popular-gods-1.png',
  },
  {
    id: 2,
    name: 'Инструкция по пошиву Комбинезон 0717',
    favorite: false,
    backgroundImage: '/static/test/popular-gods-2.png',
  },
  {
    id: 3,
    name: 'Мастер-класс по пошиву Жакета 0305',
    favorite: false,
    backgroundImage: '/static/test/popular-gods-3.png',
  },
];
