export const PRODUCT_ROUTE_PATH = '/product';

export const PRODUCT_STORE_NAME = 'PRODUCT';

export const PRODUCT_API = {
  PRODUCT_UPLOAD: {
    ENDPOINT: '/',
    TYPE: 'POST',
  },
};

export const TEST_PRODUCT_DATA = {
  name: 'Комбинезон 0717',
  bestSeller: true,
  description: {
    short: 'Верхня одежда, сложный пошив, печатная версия',
    full: 'Комбинезон женский сложного кроя, прямого силуэта. Перед и спинка с вертикальным членением в виде фартука, по рельефам застрочены складки. Рукав-реглан до локтя с объемной сборкой по низу и притачной манжетой. По талии настрачивается кулиса с лентой (если с лицевой стороны) или кулиса с резинкой (если с изнаночной стороны)  Комбинезон женский сложного кроя, прямого силуэта. Перед и спинка с вертикальным членением в виде фартука, по рельефам застрочены складки. Рукав-реглан до локтя с объемной сборкой по низу и притачной манжетой. По талии настрачивается кулиса с лентой (если с лицевой стороны) или кулиса с резинкой (если с изнаночной стороны) ',
    materials:
      'РекомеРекомендуемые материалы (Двоеточие) пальтовые матРекомендуемые материалы (Двоеточие) пальтовые матРекомендуемые материалы (ДвоеточиРекомендуемые материалы (Двоеточие) пальтовые матРекомендуемые материалы (Двоеточие) пальтовые мате) пальтовые матРекомендуемые материалы (Двоеточие) пальтовые матндуемые материалы (Двоеточие) пальтовые материалы натуральных и смешанных составов. При пошиве из ворсовых материалов следует выбирать эту модель с рукавом реглан, так как в цельнокроеном рукаве-3 направление ворса пойдет по косой и могут проявиться залысины в ворсе — проверить ткань, сложив под углом 45 ',
  },
  price: 300,
  discount: 5,
  liked: true,
  inBacket: true,
  options: {
    size: [
      { id: 0, tid: `Детский` },
      { id: 1, tid: `Подростковый` },
      { id: 2, tid: `Взрослый` },
    ],
    color: [
      { id: 0, tid: `Красный` },
      { id: 1, tid: `Синий` },
      { id: 2, tid: `Зелёный` },
    ],
  },
  images: [
    '/static/test/product-image-1.png',
    '/static/test/product-image-2.png',
    '/static/test/product-image-3.png',
  ],
};
export const TEST_PRODUCT_OPTIONS_KEY = {
  SIZE: 'size',
  COLOR: 'color',
};
export const TEST_PRODUCT_TITLE_BY_KEY = {
  size: 'Размер',
  color: 'Цвет',
};
